Repository: MrLurch81/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/how-to/database/postgresql-restore-backup.po
Languages: nl

source: Database: Restore a backup (PostgreSQL)
nl: Database: Back-up terugzetten (PostgreSQL)

source: Whether you can restore a backup, depends on the current state of the database. See the pre checks below to verify some states before restore.
nl: Of je daadwerkelijk een backup kan importeren hangt af van de huidige staat van de database. Zie de pre-checks hieronder hoe je de staat kan achterhalen, voordat je probeert te importeren.

source: **How to check whether the database exists?**
nl: **Hoe controleer ik of de database bestaat?**

source: Execute::
nl: Voer uit::

source: If the database exists, you will see output similar to this::
nl: Indien de database bestaat, dan zou je ongeveer deze output moeten zien::

source: **How to check whether the database has a table structure?**
nl: **Hoe controleer ik of de database al een tabelstructuur heeft?**

source: If the table structure exists, you should see a long list of tables in the output.
nl: Indien de tabelstructuur bestaat, zou je een lange lijst van tabelnamen in de output moeten zien.

source: **How to check whether the database has existing day/hour statistics data?**
nl: **Hoe controleer ik of de database al bestaande uur-/dagstatistieken heeft?**

source: *This only makes sense to check if the database exists and has a table structure.*
nl: *Dit is alleen zinnig om te doen als de database bestaat en al een tabelstructuur heeft.*

source: If the ``hour_count`` or ``day_count`` (or both) are **above zero**, then there are day and/or hour statistics stored::
nl: Indien ``hour_count`` of ``day_count`` (of beiden) **hoger dan nul zijn**, dan zijn er uur- en/of dagstatistieken opgeslagen::

source: Importing a full backup
nl: Volledige backup importeren

source: A full backup contains all data with its table structure and is usually named: ``dsmrreader-postgresql-backup-Friday.sql.gz``
nl: Een volledige backup bevat alle gegevens met bijbehorende tabelstructuur en heet meestal iets als: ``dsmrreader-postgresql-backup-Friday.sql.gz``

source: You can only import a full backup when:
nl: Je kunt een volledige backup alleen importeren wanneer::

source: The database **does** exist.
nl: De database **wel** bestaat.

source: The database **does not** contain a table structure (and thus no data).
nl: De database **geen** tabelstructuur heeft (en dus ook geen gegevens).

source: If the database does not exist, create it::
nl: Als de database nog niet bestaat, maak deze dan aan::

source: If it has a table structure, usually just after reinstallation, then wipe it. **This will permanently delete all data in it!**
nl: Als het al een tabelstructuur heeft, doorgaans als je net een herinstallatie hebt gedaan, verwijder deze dan. **Dit verwijdert ook alle gegevens in de database!**

source: You can now import the full backup.
nl: Je kunt nu de volledige backup importeren.

source: Keep an eye out for any errors during the steps above.
nl: Houd een oogje in het zeil of je bij bovenstaande stappen fouten ziet.

source: Importing a partial backup
nl: Gedeeltelijke backup importeren

source: A partial backup only contains a small subset of data and is usually named: ``dsmrreader-postgresql-partial-backup-2021-03-22.sql.gz``
nl: Een gedeeltelijke backup bevat een subset aan gegevens en heet meestal iets als: ``dsmrreader-postgresql-partial-backup-2021-03-22.sql.gz``

source: You can only import a partial backup when:
nl: Je kunt een gedeeltelijke backup alleen importeren wanneer::

source: The database **does** contain a table structure.
nl: De tabelstructuur **wel** bestaat.

source: The database **does not** contain existing day/hour statistics.
nl: De database **geen** bestaande uur-/dagstatistieken bevat.

source: If the database does not exist, create it.
nl: Als de database nog niet bestaat, maak deze dan aan.

source: If the database does not have a table structure, then try creating it. This assumes you already reinstalled DSMR-reader. In the case you are still reinstalling, please finish that guide first and return after.
nl: Als de database nog geen tabelstructuur heeft, probeer deze dan aan te maken. Dit doet de aanname dat je DSMR-reader al weer geherinstalleerd hebt. Zo niet, voltooi eerst de herinstallatie en kom direct daarna hier weer terug.

source: If the database already contains day/hour statistics, you probably want to abort the restore and create an issue on Github for support instead.
nl: Indien de database al bestaande uur-/dagstatistieken heeft wil je waarschijnlijk geen import doen, maar in plaats daarvan een issue aanmaken op Github voor ondersteuning.

source: You can now import the partial backup.
nl: Je kunt nu de gedeeltelijke backup importeren.
