Repository: MrLurch81/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/how-to/admin/mqtt.po
Languages: nl

source: The application has native support for MQTT. In the screen below you can enter all information about the broker you're using.
nl: De applicatie heeft ingebouwde ondersteuning voor MQTT. In het onderstaande scherm kun je allerlei informatie invullen over de broker die gebruikt.

source: There are options for using different ports, SSL, authentication and even the Quality of Service (QoS) used. More information about MQTT QoS `can be found here <https://www.hivemq.com/blog/mqtt-essentials-part-6-mqtt-quality-of-service-levels>`_.
nl: Er zijn opties beschikbaar voor het definiÃ«ren van verschillende poorten, SSL, authenticatie en zelfs de "Quality of Service" (QoS). Meer informatie over MQTT QoS `vind je hier <https://www.hivemq.com/blog/mqtt-essentials-part-6-mqtt-quality-of-service-levels>`_.

source: There are multiple configurations available for sending MQTT messages to your broker. You can enable them seperately, depending on your needs. Many of these also allow you to define which fields are sent and how they should be identified in messages sent to the broker.
nl: Er zijn meerdere configuraties beschikbaar voor het versturen van MQTT-berichten naar je broker toe. Je kunt deze los van elkaar inschakelen, afhankelijk van je eigen behoeftes. Daarnaast staan veel van deze opties je toe te bepalen welke velden verstuurd worden. Evenals de naamgeving van deze velden.

source: Day totals
nl: Dagtotalen

source: This allows you to receive the day totals in JSON format:
nl: Dit staat je toe om de dagtotalen in JSON-formaat te ontvangen:

source: The same data, but splitted among topics. This allows you to post a single piece of data on a separate topic:
nl: Dezelfde gegevens, maar gesplitst over meerdere topics. Dit staat je toe om specifieke gegevens apart in losse topics te ontvangen:

source: Meter statistics
nl: Meterstatistieken

source: Statistics of your meter, splitted among topics:
nl: Statistieken van je slimme meter, gesplitst over meerdere topics:

source: MQTT Split Topic Meter Statistics
nl: MQTT Split Topic Meter Statistieken

source: Telegram in JSON format:
nl: Telegram in JSON-formaat:

source: Or splitted among topics:
nl: Of gesplitst over meerdere topics:

source: Or in raw DSMR protocol format (when available):
nl: Of in ruw DSMR-protocol formaat (wanneer beschikbaar):

source: MQTT JSON day Totals
nl: MQTT JSON dagtotalen

source: MQTT Split Topic Day Totals
nl: MQTT Split Topic dagtotalen

source: MQTT Raw Telegram
nl: MQTT ruw telegram
