Repository: MrLurch81/dsmr-reader
Catalog: docs/_locale/*/LC_MESSAGES/how-to/troubleshooting/enabling-debug-logging.po
Languages: nl

source: Troubleshooting: Enable DEBUG logging
nl: Hulp bij problemen: DEBUG-logging inschakelen

source: DSMR-reader has DEBUG logging, which makes the system log very verbosely about what it's trying to do and **why** it executes or skips certain actions.
nl: DSMR-reader heeft DEBUG-logging, waarmee het systeem heel letterlijk logt wat het aan het doen is en **waarom** het sommige acties wel of niet uitvoert.

source: This applies **specifically** to the ``dsmr_backend`` process and its log.
nl: Dit geldt **specifiek** voor het ``dsmr_backend`` proces en bijbehorende log.

source: Errors are likely to be logged at all times, no matter the logging level used. DEBUG logging is only helpful to watch DSMR-reader's detailed behaviour, when debugging issues.
nl: Fouten worden doorgaans altijd gelogd, ongeacht het logging niveau. DEBUG-logging is alleen nuttig om het gedrag van DSMR-reader in meer detail te observeren, om issues te debuggen.

source: The DEBUG logging is **disabled by default**, to reduce the number writes on the filesystem.
nl: De DEBUG-logging is **standaard uitgeschakeld** om het aantal schrijfacties op het bestandssysteem te beperken.

source: Don't forget to disable DEBUG logging whenever you are done debugging.
nl: Vergeet niet om DEBUG-logging weer uit te schakelen wanneer je klaar bent met debuggen.

source: You can enable the DEBUG logging by setting the ``DSMRREADER_LOGLEVEL`` env var to ``DEBUG``. Follow these steps:
nl: Je kunt DEBUG-logging inschakelen door de ``DSMRREADER_LOGLEVEL`` env var op ``DEBUG`` te zetten. Volg deze stappen:

source: Make sure you are ``dsmr`` user by executing::
nl: Zorg ervoor dat je ``dsmr`` gebruiker bent door dit uit te voeren::

source: Open the ``.env`` file and look for the code below::
nl: Open ``.env`` en zoek de onderstaande code::

source: Now remove the ``###`` from this line::
nl: Verwijder nu de ``###`` uit de regel::

source: It should now be::
nl: Het zou nu dit moeten zijn::

source: After editing the file, all processes need to be restarted to reflect the change. Go back to the **root user or sudoer** with::
nl: Na het bewerken van het bestand zul je alle processen moeten herstarten om de wijziging door te voeren. Ga terug naar de **root of sudo-gebruiker** met::

source: And restart::
nl: En herstart::

source: All done!
nl: Klaar!

source: :doc:`See here for where to find the log files </how-to/troubleshooting/logfiles>`.
nl: :doc:`Bekijk hier waar je de logfiles kan vinden </how-to/troubleshooting/logfiles>`.
